Конфигурация/src/Catalogs/Гости/Гости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Гости</name>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Конфигурация/src/Catalogs/Гости/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
    
    // Пересчитываем наименование при изменении ФИО
    ОбновитьНаименование();
    
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
    
    ОбновитьНаименование();
    
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
    
    ОбновитьНаименование();
    
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименование()
    
    // Формируем ФИО из полей
    Наименование = "";
    
    Если ЗначениеЗаполнено(Объект.Фамилия) Тогда
        Наименование = СокрЛП(Объект.Фамилия);
    КонецЕсли;
    
    Если ЗначениеЗаполнено(Объект.Имя) Тогда
        Наименование = Наименование + " " + СокрЛП(Объект.Имя);
    КонецЕсли;
    
    Если ЗначениеЗаполнено(Объект.Отчество) Тогда
        Наименование = Наименование + " " + СокрЛП(Объект.Отчество);
    КонецЕсли;
    
    // Устанавливаем в поле Наименование
    Объект.Наименование = Наименование;
    
КонецПроцедуры
